; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-77)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity v5 c2)
    (capacity v6 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l5)
    (at p2 l6)
    (at p3 l1)
    (at p4 l10)
    (at p5 l8)
    (at p6 l9)
    (at p7 l10)
    (at p8 l6)
    (at p9 l10)
    (at p10 l13)
    (at p11 l9)
    (at p12 l3)
    (at p13 l14)
    (at v1 l10)
    (at v2 l11)
    (at v3 l12)
    (at v4 l9)
    (at v5 l14)
    (at v6 l1)
    (road l3 l1)
    (road l4 l9)
    (road l5 l1)
    (road l8 l9)
    (road l9 l8)
    (road l9 l11)
    (road l1 l6)
    (road l1 l3)
    (road l2 l8)
    (road l6 l14)
    (road l12 l9)
    (road l14 l6)
    (road l8 l2)
    (road l9 l7)
    (road l9 l4)
    (road l8 l14)
    (road l10 l8)
    (road l1 l5)
    (road l6 l1)
    (road l7 l9)
    (road l6 l13)
    (road l14 l8)
    (road l9 l12)
    (road l11 l9)
    (road l8 l10)
    (road l13 l6)
    (road l5 l6)
    (road l6 l5)
    (road l5 l9)
    (road l9 l5)
    (road l13 l14)
    (road l14 l13)
    (road l3 l7)
    (road l7 l3)
    (road l5 l10)
    (road l10 l5)
    (road l2 l13)
    (road l13 l2)
    (road l7 l13)
    (road l13 l7)
    (road l2 l10)
    (road l10 l2)
    (road l9 l14)
    (road l14 l9)
    (road l5 l8)
    (road l8 l5)
    (road l11 l13)
    (road l13 l11)
    (road l8 l12)
    (road l12 l8)
    (road l6 l11)
    (road l11 l6)
    (road l10 l13)
    (road l13 l10)
    (road l6 l9)
    (road l9 l6)
    (road l5 l7)
    (road l7 l5)
    (road l3 l13)
    (road l13 l3)
    (road l1 l2)
    (road l2 l1)
    )
 (:goal (and 
(at p1 l6)
(at p2 l2)
(at p3 l6)
(at p4 l8)
(at p5 l7)
))
)

; plan
1. (pick-up v1 l10 p4 c0 c1)
   deleted: (at p4 l10) (capacity v1 c1)
   added: (in p4 v1) (capacity v1 c0)
   goals met: 0 of 5
2. (drive v1 l10 l8)
   deleted: (at v1 l10)
   added: (at v1 l8)
   goals met: 0 of 5
3. (drop v1 l8 p4 c0 c1)
   deleted: (in p4 v1) (capacity v1 c0)
   added: (at p4 l8) (capacity v1 c1)
   goals met: 1 of 5
4. (pick-up v1 l8 p5 c0 c1)
   deleted: (at p5 l8) (capacity v1 c1)
   added: (in p5 v1) (capacity v1 c0)
   goals met: 1 of 5
5. (drive v1 l8 l5)
   deleted: (at v1 l8)
   added: (at v1 l5)
   goals met: 1 of 5
6. (drive v1 l5 l7)
   deleted: (at v1 l5)
   added: (at v1 l7)
   goals met: 1 of 5
7. (drop v1 l7 p5 c0 c1)
   deleted: (in p5 v1) (capacity v1 c0)
   added: (at p5 l7) (capacity v1 c1)
   goals met: 2 of 5
8. (drive v1 l7 l5)
   deleted: (at v1 l7)
   added: (at v1 l5)
   goals met: 2 of 5
9. (pick-up v1 l5 p1 c0 c1)
   deleted: (at p1 l5) (capacity v1 c1)
   added: (in p1 v1) (capacity v1 c0)
   goals met: 2 of 5
10. (drive v1 l5 l6)
   deleted: (at v1 l5)
   added: (at v1 l6)
   goals met: 2 of 5
11. (drop v1 l6 p1 c0 c1)
   deleted: (in p1 v1) (capacity v1 c0)
   added: (at p1 l6) (capacity v1 c1)
   goals met: 3 of 5
12. (pick-up v6 l1 p3 c0 c1)
   deleted: (at p3 l1) (capacity v6 c1)
   added: (in p3 v6) (capacity v6 c0)
   goals met: 3 of 5
13. (drive v6 l1 l6)
   deleted: (at v6 l1)
   added: (at v6 l6)
   goals met: 3 of 5
14. (drop v6 l6 p3 c0 c1)
   deleted: (in p3 v6) (capacity v6 c0)
   added: (at p3 l6) (capacity v6 c1)
   goals met: 4 of 5
15. (pick-up v1 l6 p2 c0 c1)
   deleted: (at p2 l6) (capacity v1 c1)
   added: (in p2 v1) (capacity v1 c0)
   goals met: 4 of 5
16. (drive v1 l6 l1)
   deleted: (at v1 l6)
   added: (at v1 l1)
   goals met: 4 of 5
17. (drive v1 l1 l2)
   deleted: (at v1 l1)
   added: (at v1 l2)
   goals met: 4 of 5
18. (drop v1 l2 p2 c0 c1)
   deleted: (in p2 v1) (capacity v1 c0)
   added: (at p2 l2) (capacity v1 c1)
   goals met: 5 of 5
